<?php
$lang['db_invalid_connection_str'] = 'Неможливо визначити параметри бази даних на основі рядка підключення, яку ви надали.';
$lang['db_unable_to_connect'] = 'Неможливо підключитися до сервера бази даних, використовуючи надані параметри.';
$lang['db_unable_to_select'] = 'Неможливо вибрати зазначену базу даних: %s';
$lang['db_unable_to_create'] = 'Неможливо створити зазначену базу даних: %s';
$lang['db_invalid_query'] = 'Представлений вами запит є неприпустимим..';
$lang['db_must_set_table'] = 'Необхідно вказати таблицю бази даних, яка буде використана в вашому запиті';
$lang['db_must_use_set'] = 'Необхідно використовувати метод "set" для поновлення запису.';
$lang['db_must_use_index'] = 'Необхідно вказати індекс для пакетного поновлення.';
$lang['db_batch_missing_index'] = 'Одна або кілька рядків представлених для пакетного оновлення не містить вказаний індекс.';
$lang['db_must_use_where'] = 'Оновлення не допускаються, без вказівки умови через оператор "where".';
$lang['db_del_must_use_where'] = 'Видалення не допускаються, без вказівки умови через "where" або "like" параметр.';
$lang['db_field_param_missing'] = 'Для вибірки полів необхідно ім\'я таблиці в якості параметра.';
$lang['db_unsupported_function'] = '\'Ця функція недоступна для використовуваної бази даних.';
$lang['db_transaction_failure'] = 'Транзакція не вдалася: Здійснюється відкат.';
$lang['db_unable_to_drop'] = 'Неможливо вилучити вказану базу даних.';
$lang['db_unsupported_feature'] = 'Непідтримувана особливість платформи бази даних яку ви використовуєте.';
$lang['db_unsupported_compression'] = 'Формат стиснення файлів який ви обрали не підтримується вашим сервером.';
$lang['db_filepath_error'] = 'Неможливо записати дані в файл, використовуючи шлях який ви вказали.';
$lang['db_invalid_cache_path'] = 'Шлях до кеш файлів, зазначений вами, некоректний або недоступний для запису.';
$lang['db_table_name_required'] = 'Необхідно вказати ім\'я таблиці для цієї операції.';
$lang['db_column_name_required'] = 'Необхідно вказати ім\'я стовпця для цієї операції.';
$lang['db_column_definition_required'] = 'Вказівка стовпчика обов\'язково для цієї операції.';
$lang['db_unable_to_set_charset'] = 'Неможливо встановити кодування з\'єднання: %s';
$lang['db_error_heading'] = 'Помилка бази даних.';


/* End of file db_lang.php */
/* Location: ./application/language/ukrainian/db_lang.php */
