<?php
$lang['ftp_no_connection'] = 'Не вдалося знайти правильний ідентифікатор з\'єднання. Будь ласка, переконайтеся, що ви підключені перед виконанням будь-яких процедур.';
$lang['ftp_unable_to_connect'] = 'Неможливо підключитися до FTP-сервера за допомогою доданого імені хоста.';
$lang['ftp_unable_to_login'] = 'Неможливо увійти в свій FTP-сервер. Будь ласка, перевірте ім\'я користувача і пароль.';
$lang['ftp_unable_to_mkdir'] = 'Неможливо створити вказаний каталог.';
$lang['ftp_unable_to_changedir'] = 'Неможливо змінити каталоги.';
$lang['ftp_unable_to_chmod'] = 'Неможливо встановити права доступу до файлів. Будь ласка, перевірте ваш шлях.';
$lang['ftp_unable_to_upload'] = 'Неможливо завантажити файл. Будь ласка, перевірте ваш шлях.';
$lang['ftp_unable_to_download'] = 'Неможливо завантажити файл. Будь ласка, перевірте ваш шлях.';
$lang['ftp_no_source_file'] = 'Не вдалося знайти вихідний файл. Будь ласка, перевірте ваш шлях.';
$lang['ftp_unable_to_rename'] = 'Неможливо перейменувати файл.';
$lang['ftp_unable_to_delete'] = 'Неможливо видалити файл.';
$lang['ftp_unable_to_move'] = 'Неможливо перемістити файл. Будь ласка, переконайтеся, що каталог призначення існує.';


/* End of file ftp_lang.php */
/* Location: ./application/language/ukrainian/ftp_lang.php */
