<?php
$lang['imglib_source_image_required'] = 'Необхідно вказати вихідне зображення в ваших перевагах.';
$lang['imglib_gd_required'] = 'Бібліотека GD зображень потрібна для цієї функції.';
$lang['imglib_gd_required_for_props'] = 'Ваш сервер повинен підтримувати бібліотеку зображень GD з метою визначення властивостей зображення.';
$lang['imglib_unsupported_imagecreate'] = 'Ваш сервер не підтримує функцію GD, необхідне для обробки цього типу зображення.';
$lang['imglib_gif_not_supported'] = 'GIF зображення часто не підтримуються через ліцензійні обмеження. Вам, можливо, доведеться використовувати JPG або PNG зображення.';
$lang['imglib_jpg_not_supported'] = 'JPG зображення не підтримуються.';
$lang['imglib_png_not_supported'] = 'PNG зображення не підтримуються.';
$lang['imglib_jpg_or_png_required'] = 'Протокол зміни розміру зображення, зазначений в ваших перевагах працює тільки з типами зображення JPEG або PNG.';
$lang['imglib_copy_error'] = 'Сталася помилка під час спроби замінити файл. Будь ласка, переконайтеся, що ваш каталог доступний для запису.';
$lang['imglib_rotate_unsupported'] = 'Поворот зображення не підтримується сервером.';
$lang['imglib_libpath_invalid'] = 'Шлях до вашої бібліотеки зображень не є вірним. Будь ласка, встановіть вірний шлях в налаштуваннях зображення.';
$lang['imglib_image_process_failed'] = 'Обробка зображень не вдалась. Будь ласка, переконайтеся, що ваш сервер підтримує обраний протокол і що шлях до вашої бібліотеки зображень є вірний.';
$lang['imglib_rotation_angle_required'] = 'Потрібно кут повороту, щоб повернути зображення.';
$lang['imglib_invalid_path'] = 'Шлях до зображення не вірним.';
$lang['imglib_copy_failed'] = 'Процедура копіювання зображень не вдалась.';
$lang['imglib_missing_font'] = 'Не вдалося знайти шрифт.';
$lang['imglib_save_failed'] = 'Неможливо зберегти зображення. Будь ласка, переконайтеся, що зображення і каталог файлів можуть бути перезаписані.';


/* End of file imglib_lang.php */
/* Location: ./application/language/ukrainian/imglib_lang.php */
