<?php
$lang['db_invalid_connection_str'] = 'Δεν είναι δυνατός ο προσδιορισμός των ρυθμίσεων της βάσης δεδομένων με βάση τη συμβολοσειρά σύνδεσης που υποβάλατε.';
$lang['db_unable_to_connect'] = 'Η σύνδεση στο διακομιστή βάσης δεδομένων δεν είναι δυνατή χρησιμοποιώντας τις παρεχόμενες ρυθμίσεις.';
$lang['db_unable_to_select'] = 'Δεν είναι δυνατή η επιλογή της καθορισμένης βάσης δεδομένων: %s';
$lang['db_unable_to_create'] = 'Δεν είναι δυνατή η δημιουργία της καθορισμένης βάσης δεδομένων: %s';
$lang['db_invalid_query'] = 'Το ερώτημα υποβάλατε δεν είναι έγκυρο.';
$lang['db_must_set_table'] = 'Πρέπει να ορίσετε τον πίνακα βάσης δεδομένων που θα χρησιμοποιηθεί με το ερώτημά σας.';
$lang['db_must_use_set'] = 'Πρέπει να χρησιμοποιείσετε';
$lang['db_must_use_index'] = 'Πρέπει να καθορίσετε ένα πεδίο που θα χρησιμοποιηθεί για σύγκριση στις μαζικές ενημερώσεις.';
$lang['db_batch_missing_index'] = 'Το καθορισμένο πεδίο λείπει από μία ή περισσότερες από τις γραμμές που υποβλήθηκαν για ομαδική ενημέρωση.';
$lang['db_must_use_where'] = 'Οι ενημερώσεις δεν επιτρέπονται, εκτός αν περιέχεται ένας όρος';
$lang['db_del_must_use_where'] = 'Οι διαγραφές δεν επιτρέπονται, εκτός αν περιέχουν έναν όρο "where" ή "like".';
$lang['db_field_param_missing'] = 'Η φόρτωση πεδίων απαιτεί το όνομα του πίνακα ως παράμετρο.';
$lang['db_unsupported_function'] = 'Αυτή η δυνατότητα δεν είναι διαθέσιμη για τη βάση δεδομένων που χρησιμοποιείτε.';
$lang['db_transaction_failure'] = 'Αποτυχία συναλλαγής: Εκτελέστηκε επαναφορά.';
$lang['db_unable_to_drop'] = 'Δεν είναι δυνατό να διαγραφεί η καθορισμένη βάση δεδομένων.';
$lang['db_unsuported_feature'] = 'Το χαρακτηριστικό δεν υποστηρίζεται από την πλατφόρμα βάσης δεδομένων που χρησιμοποιείτε.';
$lang['db_unsuported_compression'] = 'Η μορφή συμπίεσης αρχείων που επιλέξατε δεν υποστηρίζεται από το διακομιστή.';
$lang['db_filepath_error'] = 'Δεν είναι δυνατή η εγγραφή δεδομένων στο τη διαδρομή του αρχείου που υποβάλατε.';
$lang['db_invalid_cache_path'] = 'Το μονοπάτι της cache που υποβάλατε δεν είναι έγκυρο ή είναι μόνο για ανάγνωση.';
$lang['db_table_name_required'] = 'Ένα όνομα πίνακα είναι απαραίτητο για την πράξη αυτή.';
$lang['db_column_name_required'] = 'Ένα όνομα στήλης απαιτείται για την πράξη αυτή.';
$lang['db_column_definition_required'] = 'Ένας ορισμό στήλης είναι απαραίτητος για την πράξη αυτή.';
$lang['db_unable_to_set_charset'] = 'Δεν είναι δυνατός ο ορισμός σετ χαρακτήρων στη σύνδεση του πελάτη: %s';
$lang['db_error_heading'] = 'Παρουσιάστηκε ένα σφάλμα βάσης δεδομένων';

/* End of file db_lang.php */
/* Location: ./application/language/greek/db_lang.php */
