<?php
$lang['ftp_no_connection'] = 'Δεν είναι δυνατός ο εντοπισμός μιας έγκυρης ταυτότητας σύνδεσης. Βεβαιωθείτε ότι είστε συνδεδεμένοι πριν από την εκτέλεση οποιασδήποτε ρουτίνας αρχείου.';
$lang['ftp_unable_to_connect'] = 'Δεν είναι δυνατή η σύνδεση με τον διακομιστή FTP χρησιμοποιώντας το παρεχόμενο όνομα διακομιστή.';
$lang['ftp_unable_to_login'] = 'Δεν είναι δυνατή η σύνδεση στο διακομιστή FTP. Ελέγξτε το όνομα χρήστη και τον κωδικό πρόσβασης.';
$lang['ftp_unable_to_makdir'] = 'Δεν είναι δυνατή η δημιουργία του καταλόγου που καθορίσατε.';
$lang['ftp_unable_to_changedir'] = 'Δεν είναι δυνατή η αλλαγή καταλόγων.';
$lang['ftp_unable_to_chmod'] = 'Δεν είναι δυνατό να ορίσετε δικαιώματα αρχείων. Παρακαλούμε να ελέγξετε τη διαδρομή του αρχείου. Σημείωση: Αυτό το χαρακτηριστικό είναι μόνο διαθέσιμο με PHP 5 ή υψηλότερη.';
$lang['ftp_unable_to_upload'] = 'Δεν είναι δυνατό να φορτωθεί το καθορισμένο αρχείο. Παρακαλούμε να ελέγξετε τη διαδρομή του αρχείου.';
$lang['ftp_unable_to_download'] = 'Δεν είναι δυνατή η λήψη του καθορισμένου αρχείου. Παρακαλούμε να ελέγξετε τη διαδρομή του αρχείου.';
$lang['ftp_no_source_file'] = 'Δεν είναι δυνατός ο εντοπισμός του αρχείου προέλευσης. Παρακαλούμε να ελέγξετε τη διαδρομή του αρχείου.';
$lang['ftp_unable_to_rename'] = 'Δεν είναι δυνατή η μετονομασία του αρχείου.';
$lang['ftp_unable_to_delete'] = 'Δεν είναι δυνατή η διαγραφή του αρχείου.';
$lang['ftp_unable_to_move'] = 'Δεν είναι δυνατή η μετακίνηση του αρχείου. Βεβαιωθείτε ότι υπάρχει ο κατάλογος προορισμού.';

/* End of file ftp_lang.php */
/* Location: ./application/language/greek/ftp_lang.php */
