<?php
$lang['imglib_source_image_required']   = 'Πρέπει να καθορίσετε μια πηγή εικόνας στις προτιμήσεις σας.';
$lang['imglib_gd_required']             = 'Η βιβλιοθήκη εικόνας GD απαιτείται για αυτό το χαρακτηριστικό.';
$lang['imglib_gd_required_for_props']   = 'Ο διακομιστής σας πρέπει να υποστηρίζει τη βιβλιοθήκη εικόνας GD προκειμένου να καθορίσει τις ιδιότητες της εικόνας.';
$lang['imglib_unsupported_imagecreate'] = 'Ο διακομιστής σας δεν υποστηρίζει τη λειτουργία GD που απαιτείται για την επεξεργασία αυτού του τύπου εικόνας.';
$lang['imglib_gif_not_supported']       = 'Οι εικόνες GIF συχνά δεν υποστηρίζονται λόγω περιορισμών της άδειας.  Ίσως χρειαστεί να χρησιμοποιήσετε εικόνες JPG ή PNG.';
$lang['imglib_jpg_not_supported']       = 'Δεν υποστηρίζονται εικόνες JPG.';
$lang['imglib_png_not_supported']       = 'Δεν υποστηρίζονται εικόνες PNG.';
$lang['imglib_jpg_or_png_required']     = 'Το πρωτόκολλο της αλλαγής μεγέθους εικόνας που καθορίζεται στις προτιμήσεις σας λειτουργεί μόνο με τύπους εικόνας JPEG ή PNG.';
$lang['imglib_copy_error']              = 'Παρουσιάστηκε σφάλμα κατά την προσπάθεια αντικατάστασης του αρχείου.  Παρακαλώ σιγουρευτείτε ότι το αρχείο καταλόγου σας είναι εγγράψιμο.';
$lang['imglib_rotate_unsupported']      = 'Η περιστροφή εικόνας δεν φαίνεται να υποστηρίζεται από το διακομιστή σας.';
$lang['imglib_libpath_invalid']         = 'Η διαδρομή της βιβλιοθήκης εικόνας δεν είναι σωστή.  Ορίστε τη σωστή διαδρομή στις προτιμήσεις εικόνων.';
$lang['imglib_image_process_failed']    = 'Απέτυχε η επεξεργασία της εικόνας. Βεβαιωθείτε ότι ο διακομιστής υποστηρίζει το επιλεγμένο πρωτόκολλο και ότι η διαδρομή της βιβλιοθήκης εικόνας είναι σωστή.';
$lang['imglib_rotation_angle_required'] = 'Μια γωνία περιστροφής απαιτείται για να περιστρέψετε την εικόνα.';
$lang['imglib_writing_failed_gif']      = 'Εικόνα GIF.';
$lang['imglib_invalid_path']            = 'Η διαδρομή για την εικόνα δεν είναι σωστή.';
$lang['imglib_copy_failed']             = 'Απέτυχε η ρουτίνα αντιγραφής εικόνας.';
$lang['imglib_missing_font']            = 'Δεν είναι δυνατόν να βρεθεί μια γραμματοσειρά για χρήση.';
$lang['imglib_save_failed']             = 'Δεν είναι δυνατή η αποθήκευση της εικόνας.  Παρακαλώ βεβαιωθείτε ότι η εικόνα και το αρχείο καταλόγου είναι εγγράψιμο.';


/* End of file imglib_lang.php */
/* Location: ./application/language/greek/imglib_lang.php */
