<?php

$lang['required']			= "Поле %s обязательно к заполнению.";
$lang['isset']				= "Поле %s должно содержать значение.";
$lang['valid_email']		= "Поле %s должно содержать правильный адрес электронной почты.";
$lang['valid_emails']		= "Поле %s должно содержать все правильные адреса электронной почты.";
$lang['valid_url']			= "Поле %s должно содержать правильный URL.";
$lang['valid_ip']			= "Поле %s должно содержать правильный IP.";
$lang['min_length']			= "Поле %s должно содержать минимум %s символов.";
$lang['max_length']			= "Поле %s не может превышать %s символов.";
$lang['exact_length']		= "Поле %s должно содержать ровно %s символов.";
$lang['alpha']				= "Поле %s может содержать только буквы.";
$lang['alpha_numeric']		= "Поле %s может содержать только буквы и цифры.";
$lang['alpha_dash']			= "Поле %s может содержать только буквы и цифры, символы подчеркивания и тире.";
$lang['numeric']			= "Поле %s должно содержать цифры.";
$lang['is_numeric']			= "Поле %s должно содержать цифры";
$lang['integer']			= "Поле %s должно содержать число.";
$lang['regex_match']		= "Поле %s не в правильном формате.";
$lang['matches']			= "Поле %s не соответствует полю %s.";
$lang['is_unique'] 			= "Поле %s должно содержать уникальное значение.";
$lang['is_natural']			= "Поле %s должно содержать только положительные числа.";
$lang['is_natural_no_zero']	= "Поле %s должно содержать только положительные числа без нуля.";
$lang['decimal']			= "Поле %s должно содержать десятичное число.";
$lang['less_than']			= "Поле %s должно содержать число меньше %s.";
$lang['greater_than']		= "Поле %s должно содержать число больше %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */