<?php

$lang['ftp_no_connection']			= "Не удалось найти действительный идентификатор соединения. Пожалуйста, убедитесь, что вы подключены перед выполнением каких-либо действий с файлами.";
$lang['ftp_unable_to_connect']		= "Невозможно подключиться к FTP-серверу с помощью указанного имя хоста.";
$lang['ftp_unable_to_login']		= "Невозможно подключиться к FTP-серверу. Пожалуйста, проверьте имя пользователя и пароль.";
$lang['ftp_unable_to_makdir']		= "Невозможно создать указанный каталог.";
$lang['ftp_unable_to_changedir']	= "Невозможно изменить каталоги.";
$lang['ftp_unable_to_chmod']		= "Невозможно установить права доступа к файлам. Пожалуйста, проверьте ваш путь. Примечание: Эта функция доступна только в PHP 5 или выше.";
$lang['ftp_unable_to_upload']		= "Невозможно загрузить указанный файл. Пожалуйста, проверьте ваш путь.";
$lang['ftp_unable_to_download']		= "Не удается загрузить указанный файл. Пожалуйста, проверьте ваш путь.";
$lang['ftp_no_source_file']			= "Не удалось найти исходный файл. Пожалуйста, проверьте ваш путь.";
$lang['ftp_unable_to_rename']		= "Невозможно переименовать файл.";
$lang['ftp_unable_to_delete']		= "Не удается удалить файл.";
$lang['ftp_unable_to_move']			= "Не удалось переместить файл. Пожалуйста, убедитесь, что каталог назначения существует.";


/* End of file ftp_lang.php */
/* Location: ./system/language/russian/ftp_lang.php */