<?php

$lang['imglib_source_image_required'] = "Вы должны указать исходный файл в настройках.";
$lang['imglib_gd_required'] = "Необходима Библиотека изображений GD для этой функции.";
$lang['imglib_gd_required_for_props'] = "Сервер должен поддерживать библиотеку изображений GD для того, чтобы определить свойства изображения.";
$lang['imglib_unsupported_imagecreate'] = "Ваш сервер не поддерживает функцию GD, необходимую для обработки этого типа изображения.";
$lang['imglib_gif_not_supported'] = "GIF изображения часто не поддерживается из-за лицензионных ограничений. Возможно, придется использовать JPG или PNG изображения.";
$lang['imglib_jpg_not_supported'] = "JPG изображения не поддерживаются.";
$lang['imglib_png_not_supported'] = "PNG изображения не поддерживаются.";
$lang['imglib_jpg_or_png_required'] = "Протокол изменения размера изображения, указанный в настройках работает только с типами изображения JPEG или PNG.";
$lang['imglib_copy_error'] = "Ошибка при попытке замены файла. Пожалуйста, убедитесь, папка доступна для записи.";
$lang['imglib_rotate_unsupported'] = "Поворот изображения не поддерживается вашим сервером.";
$lang['imglib_libpath_invalid'] = "Путь к библиотеке изображений некорректен. Пожалуйста, установите правильный путь в настройках изображений.";
$lang['imglib_image_process_failed'] = "Обработка изображений не удалось. Пожалуйста, убедитесь, что ваш сервер поддерживает выбранный протокол и что путь к библиотеке изображений указан верно.";
$lang['imglib_rotation_angle_required'] = "Укажите угол, чтобы повернуть изображение";
$lang['imglib_writing_failed_gif'] = "GIF изображение.";
$lang['imglib_invalid_path'] = "Путь к изображению некорректен.";
$lang['imglib_copy_failed'] = "Копирование изображений не удалось.";
$lang['imglib_missing_font'] = "Невозможно найти шрифт.";
$lang['imglib_save_failed'] = "Невозможно сохранить изображение. Убедитесь, что каталог изображений доступен для записи.";


/* End of file imglib_lang.php */
/* Location: ./system/language/russian/imglib_lang.php */